# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков
#     Напишите программу, которая вычисляет стоимость введенного пользователем слова.
#     Будем считать, что на вход подается только одно слово, которое содержит либо
#     только английские, либо только русские буквы.
#     ноутбук
#     12

eng_letters =  {1:("A","E","I","O","L", "N", "S", "T", "R"),
                2:("D","G"),
                3:("B","C", "M", "P"),
                4:"F",
                5:"K",
                8:("J", "X"),
               10:("Q", "Z")}

ru_letters =   {1:("А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"),
                2:("Д", "К", "Л", "М", "П", "У"),
                3:("Б", "Г", "Ё", "Ь", "Я"),
                4:("Й", "Ы"),
                5:("Ж", "З", "Х", "Ц", "Ч"),
                8:("Ш", "Э", "Ю"),
               10:("Ф", "Щ", "Ъ")}
point = [1,2,3,4,5,8,10]
sum_points = 0
i = 0
j = 0
prov = True


language = int(input("Выберите язык: \n1 - Русский:     2 - English: \n"))
strings = input("Введите слово: ")
strings = strings.upper()

while i < len(strings):
    j = 0
    if language == 1:
        for key, value in ru_letters.items():
            for item in ru_letters.get(point[j]):
                if strings[i] == item:
                    sum_points += key
                    break
            j += 1

    elif language == 2:
        for key, value in eng_letters.items():
            for item in eng_letters.get(point[j]):
                if strings[i] == item:
                    sum_points += key
                    break
            j += 1
    i += 1
print(f"Набранные очки в данном слове: {sum_points}")